work/TSAlarmServer_WD/TSAlarmServer_WD/BasicHttpBinding_USCOREIWandaMsg.SetRTXJSON.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns4="http://schemas.datacontract.org/2004/07/NTS.WEB.DataContact.EMCS"
 xmlns:ns3="http://schemas.microsoft.com/2003/10/Serialization/"
 xmlns:ns1="http://tempuri.org/">
 <SOAP-ENV:Body>
   <ns1:SetRTXJSON>
    <ns1:infoJson></ns1:infoJson>
   </ns1:SetRTXJSON>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
